# Add sources for brew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "espanso/espanso"
tap "romkatv/powerlevel10k"

# Install brew packages
brew "autoconf"
brew "awscli"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "findutils"
brew "git"
brew "grep"
brew "hugo"
brew "htop"
brew "jq"
brew "lsd"
brew "mas"
brew "node"
brew "svn"
brew "tor"
brew "tree"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "rust"
brew "webp"
brew "wget"
brew "zola"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# Install brew casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "angry-ip-scanner"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "calibre"
cask "cleanmymac"
cask "chromium"
cask "espanso"
cask "expressions"
cask "firefox"
cask "flameshot"
cask "flux"
cask "hazel"
cask "imageoptim"
cask "istat-menus"
cask "keyboard-maestro"
cask "keyboardcleantool"
cask "libreoffice"
cask "netnewswire"
cask "numi"
cask "obsidian"
cask "rectangle"
cask "rocket"
cask "screenflow"
cask "sourcetree"
cask "sublime-text"
cask "transmit"
cask "vlc"
cask "warp"
cask "zoom"

# Install brew fonts
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-noto-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-montserrat"
cask "font-lato"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-raleway"
cask "font-oswald"
cask "font-poppins"
cask "font-merriweather"
cask "font-pt-sans"
cask "font-ubuntu"
cask "font-cuprum"
cask "font-oxygen"
cask "font-redhat"
cask "font-space-mono"
cask "font-monoid"
cask "font-milonga"
cask "font-anton"
cask "font-3270"
cask "font-abel"
cask "font-montserrat"
cask "font-playfair-display"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-im-writing-nerd-font"
cask "font-ia-writer-duospace"
cask "font-meslo-lg-nerd-font"
cask "font-fontawesome"
cask "font-jetbrains-mono"